In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

# Different type test

# 1.Non Parametric test

# A. wilcoxson test

In [7]:
dataset1 = pd.read_excel("1 Wilcoxon.xlsx")

In [8]:
dataset1.head()

   ID  TRT  AGE  WEIGHIN  STAGE  TOTALCIN  TOTALCW2  TOTALCW4 TOTALCW6
0   1    0   52    124.0      2         6         6         6        7
1   5    0   77    160.0      1         9         6        10        9
2   6    0   60    136.5      4         7         9        17       19
3   9    0   61    179.6      1         6         7         9        3
4  11    0   59    175.8      2         6         7        16       13

In [10]:
from scipy.stats import wilcoxon

In [11]:
#H0 -> There is no significance on total calsium on different weak
#H1 -> There is significance on total calsium on different weak
stats , p = wilcoxon(dataset1.TOTALCIN , dataset1.TOTALCW2)
print(stats , p)

29.5 0.00259741456482452

In [12]:
#Since p < 0.05 
#Hence H0 is rejected
#->There is significance on total calsium on different weak

# B. Friedman Test

In [15]:
from scipy.stats import friedmanchisquare

In [ ]:
#H0 -> There is no significance on total calsium on different weak
#H1 -> There is significance on total calsium on different weak

In [16]:
stats , p = friedmanchisquare(dataset1.TOTALCIN , dataset1.TOTALCW2, dataset1.TOTALCW4)
print(stats , p)

27.927710843373504 8.62133745016363e-07

In [17]:
#Since p < 0.05 
#Hence H0 is rejected
#->There is significance on total calsium on different weak

# C. Manwhitney test

In [21]:
dataset2 = pd.read_excel("3 Mann Whitney.xlsx",sheet_name=1)

In [22]:
dataset2.head()

   Design1  Design2
0       11       12
1       17       10
2       16       15
3       14       19
4       15       11

In [23]:
#H0 -> There is no significance on Design1 and design2
#H1 -> There is significance on Design1 and design2

In [25]:
from scipy.stats import  mannwhitneyu

In [26]:
stats , p = mannwhitneyu(dataset2.Design1 , dataset2.Design2)
print(stats , p)

9.0 0.2641796636354743

In [27]:
#Since p > 0.05 
#Hence H0 is Accepted
#->There is no significance on Design1 and design2

# D. kruskal Wallis test

In [29]:
dataset3 = pd.read_excel("4 Kruskal Wallis.xlsx")

In [30]:
dataset3.head()

   Design1  Design2  Design3  Showroom
0       11       12       23         1
1       17       10       20         2
2       16       15       18         3
3       14       19       17         4
4       15       11       10         5

In [31]:
#H0 -> There is no significance on Design1 , Design2 and Design3
#H1 -> There is significance on Design1 , Design2 and Design3

In [32]:
from scipy.stats import kruskal

In [ ]:
# stats , p = kruskal(dataset3.Design1 , dataset3.Design2,dataset3.Design3)
print(stats , p)

In [34]:
#Since p > 0.05 
#Hence H0 is Accepted
#->There is no significance on Design1 , design2 and design3

# E. Chisquare Test

In [35]:
dataset4 = pd.read_excel("5 Chi square Test.xlsx")

In [36]:
dataset4.head()

     ids  Gender        Smoking
0  43783  Female      NonSmoker
1  20278  Female      NonSmoker
2  20389  Female      NonSmoker
3  22820    Male            NaN
4  24559    Male  CurrentSmoker

In [42]:
dataset4.isnull

<bound method DataFrame.isnull of        ids  Gender        Smoking
0    43783  Female      NonSmoker
1    20278  Female      NonSmoker
2    20389  Female      NonSmoker
3    22820    Male            NaN
4    24559    Male  CurrentSmoker
..     ...     ...            ...
430  34021    Male      NonSmoker
431  40697  Female      NonSmoker
432  34272  Female      NonSmoker
433  33628    Male  CurrentSmoker
434  39298    Male     PastSmoker

[435 rows x 3 columns]>

In [44]:
dataset4.dropna()

       ids  Gender        Smoking
0    43783  Female      NonSmoker
1    20278  Female      NonSmoker
2    20389  Female      NonSmoker
4    24559    Male  CurrentSmoker
5    28980  Female      NonSmoker
..     ...     ...            ...
430  34021    Male      NonSmoker
431  40697  Female      NonSmoker
432  34272  Female      NonSmoker
433  33628    Male  CurrentSmoker
434  39298    Male     PastSmoker

[402 rows x 3 columns]

In [ ]:
#H0 -> There is no dependency on Gender and Smoking
#H1 -> There is dependency on Gender and Smoking

In [45]:
from scipy.stats import chi2_contingency

In [46]:
chitable = pd.crosstab(dataset4.Gender , dataset4.Smoking)

In [47]:
chitable

Smoking  CurrentSmoker  NonSmoker  PastSmoker
Gender
Female              31        149          13
Male                37        148          24

In [48]:
stats , p , dof , expected = chi2_contingency(chitable)

In [50]:
print(stats , p , dof)

3.1712567666931584 0.20481904779163013 2

In [51]:
print( expected)

[[ 32.64676617 142.58955224  17.76368159]
 [ 35.35323383 154.41044776  19.23631841]]

In [52]:
#Since p > 0.05 
#Hence H0 is Accepted
#->There is no dependency on Gender and Smoking

# 2. Parametric Test

# A. One sample t-test

In [53]:
dataset5 = pd.read_excel("1. One Sample.xlsx")

In [54]:
dataset5.head()

     ids  Height
0  43783   72.35
1  20278   70.66
2  20389   70.68
3  24559   67.43
4  28980   68.45

In [56]:
from scipy.stats import ttest_1samp

In [ ]:
#H0 -> There is no significance on sample mean and population mean
#H1 -> There is significance on sample mean and population mean

In [58]:
stats , p = ttest_1samp(dataset5.Height , 65)
print(stats , p)

11.498800238580099 1.087893570160242e-26

In [59]:
#Since p < 0.05 
#Hence H0 is Rejected
#->There is significance on sample mean and population mean

# B. Two sample paired t-test

In [60]:
from scipy.stats import ttest_rel

In [62]:
dataset6 = pd.read_excel("2. Paired Sample.xlsx")

In [64]:
dataset6.head()

     ids  English   Math
0  43783    88.24  60.02
1  20278    89.45  70.19
2  20389    96.73  71.20
3  22820    74.06  55.89
4  24559    82.61  65.52

In [65]:
#H0 -> There is no significance on one sample mean to other sample mean
#H1 -> There is significance on one sample mean to other sample mean

In [69]:
stats , p = ttest_rel(dataset6.English , dataset6.Math)
print(stats , p)

36.312568981719856 3.0710987192210606e-128

In [70]:
#Since p < 0.05 
#Hence H0 is Rejected
#->There is significance on one sample mean to other sample mean

# C. Two sample Independent t-test

In [73]:
dataset7 = pd.read_excel("3. Independent Sample.xlsx",sheet_name=3)

In [74]:
dataset7.head()

   Nonathelete  Athelete
0     0.004413  0.004462
1     0.004872  0.005146
2     0.008851  0.004023
3     0.006508  0.003941
4     0.006314  0.004764

In [75]:
#H0 -> There is no significance on Athelete and nonathelete to win the race
#H1 -> There is significance on Athelete and nonathelete to win the race

In [76]:
from scipy.stats import ttest_ind

In [77]:
stats , p = ttest_ind(dataset7.Nonathelete , dataset7.Athelete)
print(stats , p)

13.368790432137319 7.116633157230895e-33

In [78]:
#Since p < 0.05 
#Hence H0 is Rejected
#->There is significance on Athelete and nonathelete to win the race

# D. One way ANOVA

In [1]:
import pandas as pd

In [2]:
import statsmodels.api as sm

In [3]:
from statsmodels.formula.api import ols

In [5]:
dataset = pd.read_excel("ANCOVA1.xlsx",sheet_name=0)

In [6]:
dataset.head()

   Store Number  Sales  Promotion  Coupon  ClietelRatings
0             1     10          1       1               9
1             2      9          1       1              10
2             3     10          1       1               8
3             4      8          1       1               4
4             5      9          1       1               6

In [ ]:
# H0 -> low = medium = high
#H1 -> low != medium != high

In [7]:
model = ols('Sales~C(Promotion)',dataset).fit()

In [10]:
oneway = sm.stats.anova_lm(model , type=2)

In [11]:
print(oneway)

                df      sum_sq    mean_sq          F    PR(>F)
C(Promotion)   2.0  106.066667  53.033333  17.943609  0.000011
Residual      27.0   79.800000   2.955556        NaN       NaN

In [12]:
#p < 0.05
#H0 -> rejected

# E. Two way Anova

In [34]:
model = ols('Sales~C(Promotion)+C(Coupon)',dataset).fit()

In [35]:
twoway = sm.stats.anova_lm(model , type=2)

In [36]:
print(twoway)

                df      sum_sq    mean_sq          F        PR(>F)
C(Promotion)   2.0  106.066667  53.033333  52.098237  8.032739e-10
C(Coupon)      1.0   53.333333  53.333333  52.392947  1.095036e-07
Residual      26.0   26.466667   1.017949        NaN           NaN

# Calculating eteSquare

In [22]:
def anova_table(oneway):
    oneway['eta_sq'] = oneway[:-1]['sum_sq']/sum(oneway['sum_sq'])
    cols = ['df','sum_sq','mean_sq','F','PR(>F)','eta_sq']
    oneway = oneway[cols]
    return oneway

In [23]:
print(anova_table(oneway))

                df      sum_sq    mean_sq          F    PR(>F)   eta_sq
C(Promotion)   2.0  106.066667  53.033333  17.943609  0.000011  0.57066
Residual      27.0   79.800000   2.955556        NaN       NaN      NaN

In [24]:
print(anova_table(twoway))

                          df      sum_sq    mean_sq          F        PR(>F)  \
C(Promotion)             2.0  106.066667  53.033333  54.862069  1.116908e-09
C(Coupon)                1.0   53.333333  53.333333  55.172414  1.143879e-07
C(Promotion):C(Coupon)   2.0    3.266667   1.633333   1.689655  2.058092e-01
Residual                24.0   23.200000   0.966667        NaN           NaN

                          eta_sq
C(Promotion)            0.570660
C(Coupon)               0.286944
C(Promotion):C(Coupon)  0.017575
Residual                     NaN

In [37]:
model = ols('Sales~C(Promotion)+C(Coupon) + (ClietelRatings)',dataset).fit()

In [38]:
multiway = sm.stats.anova_lm(model,type=2)

In [39]:
print(multiway)

                  df      sum_sq    mean_sq          F        PR(>F)
C(Promotion)     2.0  106.066667  53.033333  51.732296  1.301539e-09
C(Coupon)        1.0   53.333333  53.333333  52.024936  1.471502e-07
ClietelRatings   1.0    0.837931   0.837931   0.817375  3.745789e-01
Residual        25.0   25.628736   1.025149        NaN           NaN

In [40]:
3.745789e-01

0.3745789

In [41]:
print(anova_table(multiway))

                  df      sum_sq    mean_sq          F        PR(>F)    eta_sq
C(Promotion)     2.0  106.066667  53.033333  51.732296  1.301539e-09  0.570660
C(Coupon)        1.0   53.333333  53.333333  52.024936  1.471502e-07  0.286944
ClietelRatings   1.0    0.837931   0.837931   0.817375  3.745789e-01  0.004508
Residual        25.0   25.628736   1.025149        NaN           NaN       NaN